import type { NextPage } from 'next';
import { Page, Stacked, Block, Figure, PlainText } from 'unflexible-ui-legacy';
import { Header, Footer } from 'components/layout';
import { PageTitle } from 'components/block';
import { Title03 } from 'components/element';
import { color } from 'lib/config';

import { view } from 'unflexible-ui-legacy';

interface Props { }

const ServicePage: NextPage = ({ }: Props) => {
  const routes = [
    { name: 'TOP', href: view.url('') },
    { name: 'プライバシーポリシー', href: view.url('privacy-policy') },
  ];

  return (
    <Page
      title="プライバシーポリシー | 株式会社ビズソリューションズ"
      description=""
      path="/service/lesson"
      ogType="article"
      header={(
        <Header
          title="プライバシーポリシー | 外国人材採用支援サービス（株式会社ビズソリューションズ）"
          language="ja"
        />
      )}
      footer={<Footer />}
      fixHeader
    >
      <Stacked paddingPos="none" color={color.lightGray} isSection>
        <PageTitle
          routes={routes}
        />
      </Stacked>

      <Stacked paddingPos="top" paddingSize="narrow" wrap>
        <Title03 name="プライバシーポリシー（個人情報保護方針）" tag="h2" icon={view.url('images/icon_security.png')} />
      </Stacked>

      <Stacked wrap>
        <PlainText h2SizeXL="1rem" h2Weight="400">
          <p>当社は，個人情報保護法をはじめとする個人情報保護に関する関係諸法令等を厳正に遵守することを誓約し，個人情報の取扱いについて，以下のとおりプライバシーポリシー（個人情報保護宣言）を定めます。</p>

          <h2>1．個人情報の定義</h2>
          <p>「個人情報」とは，個人情報保護法にいう「個人情報」を指すものとし，生存する個人に関する情報であって，当該情報に含まれる氏名，生年月日，住所，電話番号，連絡先その他の記述等により特定の個人を識別できる情報，WEB面談，適性検査等において書面等に記入された情報及び健康診断等により取得した情報などの個人を識別できる情報（個人識別情報）を指します。</p>

          <h2>2．個人情報の収集方法</h2>
          <p>当社は，利用者が会員登録をする際に、氏名，生年月日，住所，電話番号，メールアドレス，国籍・学歴，在留資格などの個人情報を収集します。また，当社に対し、利用者とのWEB面談，電子メール，書面等で情報をご提供いただくことにより収集することがあります。</p>

          <h2>3．個人情報の利用目的</h2>
          <p>職業安定法に基づく有料職業紹介業務およびこれらに付随する業務達成に必要な以下の範囲内で取扱いします。</p>
          <ul>
            <li>職業紹介のための面接・相談及び斡旋のため</li>
            <li>求人者に提供するため</li>
            <li>求人者から委託を受けた適性検査等の実施のため</li>
            <li>求人者から委託を受けた採用に関する手続の実施のため</li>
            <li>利用者からのお問い合わせに回答するため（本人確認を行うことを含む）</li>
            <li>重要なお知らせなど必要に応じた連絡のため</li>
          </ul>

          <h2>4．利用目的の変更</h2>
          <p>当社は，利用目的が変更前と関連性を有すると合理的に認められる場合に限り，個人情報の利用目的を変更するものとします。<br />利用目的の変更を行った場合には，変更後の目的について，当社所定の方法により，利用者に通知し，または本ウェブサイト上に公表するものとします。</p>

          <h2>5．個人情報の安全管理</h2>
          <p>当社は，個人情報の紛失，破壊，改ざん及び漏洩などのリスクに対して，個人情報の安全管理が図られるよう，従業員に対し，必要かつ適切な監督を行います。また，個人情報の取扱いの全部又は一部を委託する場合は，委託先において個人情報の安全管理が図られるよう，必要かつ適切な監督を行います。</p>

          <h2>6．個人情報の第三者提供</h2>
          <p>当社は，個人情報を法令の規定又は司法手続きに基づく要請による場合，及び利用目的の達成に必要な範囲内における提供等を除き，第三者に提供いたしません。ただし，利用目的の範囲内で，個人情報の全部または一部を職業紹介成立のため第三者へ提供することがあります。</p>

          <h2>7．個人情報の開示</h2>
          <p>当社は，個人情報に関し、次のいずれかに該当する場合を除き、個人情報を第三者に開示致しません。</p>
          <ul>
            <li>本人から個人情報の開示を求められた場合</li>
            <li>法令に基づき開示することが必要である場合</li>
          </ul>
          <p>前項の定めにかかわらず，履歴情報および特性情報などの個人情報以外の情報については，原則として開示いたしません。</p>

          <h2>8．登録情報の変更（訂正・追加）</h2>
          <p>利用者は，当社の保有する自己の登録情報が誤った情報である場合には，当社が定める手続きにより，当社に対して登録情報の変更等を請求することができます。<br />当社は，利用者から前項の請求を受けてその請求に応じる必要があると判断した場合には，遅滞なく登録情報の変更等を行います。</p>

          <h2>9．退会（登録情報の削除）</h2>
          <p>当社は，求人者で選考中の場合，及び内定から入社までの期間中の場合はを除き，本人から退会（登録情報削除）の申請がなされた場合には，遅滞なく登録情報の削除を行います。</p>

          <h2>10．継続的改善</h2>
          <p>人情報の取扱いに関する運用状況を適宜見直し，継続的な改善に努めるものとし，必要に応じて、本プライバシーポリシーを変更することがあります。変更後のプライバシーポリシーは，本ウェブサイトに掲載したときから効力を生じるものとします。</p>

          <h2>お問い合わせ窓口</h2>
          <p>個人情報の取扱いに関するお問い合わせは，下記の窓口までお願いいたします。<br />株式会社ビズソリューションズ　事業統括部　E メールアドレス ： office＠shuushoku-shien.co.jp</p>
        </PlainText>
      </Stacked>
    </Page>
  );
};

export default ServicePage;
